; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_15_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 - counter
	)
  (:init
		(= (value c0) 42)
	(= (value c1) 11)
	(= (value c2) 0)
	(= (value c3) 33)
	(= (value c4) 94)
	(= (value c5) 8)
	(= (value c6) 89)
	(= (value c7) 53)
	(= (value c8) 32)
	(= (value c9) 93)
	(= (value c10) 25)
	(= (value c11) 24)
	(= (value c12) 84)
	(= (value c13) 41)
	(= (value c14) 36)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
		)
	)
)

; plan
1. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 5 of 14
2. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 5 of 14
3. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 5 of 14
4. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 5 of 14
5. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 5 of 14
6. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 5 of 14
7. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 5 of 14
8. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 5 of 14
9. (increment c14)
   changed: (value c14) from 36 to 39
   goals met: 5 of 14
10. (increment c14)
   changed: (value c14) from 39 to 42
   goals met: 6 of 14
11. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 6 of 14
12. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 6 of 14
13. (increment c11)
   changed: (value c11) from 24 to 26
   goals met: 7 of 14
14. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 7 of 14
15. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 7 of 14
16. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 7 of 14
17. (increment c8)
   changed: (value c8) from 32 to 36
   goals met: 7 of 14
18. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 7 of 14
19. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 7 of 14
20. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 7 of 14
21. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 7 of 14
22. (increment c8)
   changed: (value c8) from 36 to 40
   goals met: 7 of 14
23. (increment c8)
   changed: (value c8) from 40 to 44
   goals met: 7 of 14
24. (increment c7)
   changed: (value c7) from 53 to 59
   goals met: 7 of 14
25. (increment c7)
   changed: (value c7) from 59 to 65
   goals met: 7 of 14
26. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 7 of 14
27. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 7 of 14
28. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 7 of 14
29. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 7 of 14
30. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 7 of 14
31. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 7 of 14
32. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 7 of 14
33. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 7 of 14
34. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 7 of 14
35. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 7 of 14
36. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 7 of 14
37. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 7 of 14
38. (decrement c6)
   changed: (value c6) from 89 to 86
   goals met: 7 of 14
39. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 7 of 14
40. (increment c8)
   changed: (value c8) from 44 to 49
   goals met: 7 of 14
41. (increment c8)
   changed: (value c8) from 49 to 54
   goals met: 7 of 14
42. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 7 of 14
43. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 7 of 14
44. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 7 of 14
45. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 7 of 14
46. (decrement c6)
   changed: (value c6) from 86 to 82
   goals met: 7 of 14
47. (decrement c6)
   changed: (value c6) from 82 to 78
   goals met: 7 of 14
48. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 7 of 14
49. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 7 of 14
50. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 7 of 14
51. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 7 of 14
52. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 7 of 14
53. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 7 of 14
54. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 7 of 14
55. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 7 of 14
56. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 7 of 14
57. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 7 of 14
58. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 7 of 14
59. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 7 of 14
60. (increment c5)
   changed: (value c5) from 8 to 15
   goals met: 7 of 14
61. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 7 of 14
62. (increment c5)
   changed: (value c5) from 15 to 23
   goals met: 7 of 14
63. (increment c5)
   changed: (value c5) from 23 to 31
   goals met: 7 of 14
64. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 7 of 14
65. (increment c5)
   changed: (value c5) from 31 to 40
   goals met: 7 of 14
66. (increment c5)
   changed: (value c5) from 40 to 49
   goals met: 7 of 14
67. (increment c5)
   changed: (value c5) from 49 to 58
   goals met: 7 of 14
68. (increment c5)
   changed: (value c5) from 58 to 67
   goals met: 7 of 14
69. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 7 of 14
70. (increment c5)
   changed: (value c5) from 67 to 77
   goals met: 7 of 14
71. (decrement c4)
   changed: (value c4) from 94 to 89
   goals met: 7 of 14
72. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 7 of 14
73. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 7 of 14
74. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 7 of 14
75. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 7 of 14
76. (increment c2)
   changed: (value c2) from 0 to 6
   goals met: 7 of 14
77. (increment c2)
   changed: (value c2) from 6 to 12
   goals met: 8 of 14
78. (increment c8)
   changed: (value c8) from 54 to 59
   goals met: 8 of 14
79. (increment c8)
   changed: (value c8) from 59 to 64
   goals met: 8 of 14
80. (increment c8)
   changed: (value c8) from 64 to 69
   goals met: 9 of 14
81. (decrement c4)
   changed: (value c4) from 89 to 84
   goals met: 9 of 14
82. (decrement c4)
   changed: (value c4) from 84 to 79
   goals met: 9 of 14
83. (decrement c4)
   changed: (value c4) from 79 to 74
   goals met: 10 of 14
84. (increase_rate c13)
   changed: (rate_value c13) from 5 to 6
   goals met: 10 of 14
85. (increase_rate c13)
   changed: (rate_value c13) from 6 to 7
   goals met: 10 of 14
86. (increase_rate c13)
   changed: (rate_value c13) from 7 to 8
   goals met: 10 of 14
87. (increment c13)
   changed: (value c13) from 41 to 49
   goals met: 9 of 14
88. (increment c13)
   changed: (value c13) from 49 to 57
   goals met: 9 of 14
89. (increment c13)
   changed: (value c13) from 57 to 65
   goals met: 9 of 14
90. (increase_rate c13)
   changed: (rate_value c13) from 8 to 9
   goals met: 9 of 14
91. (increase_rate c13)
   changed: (rate_value c13) from 9 to 10
   goals met: 9 of 14
92. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 9 of 14
93. (decrement c13)
   changed: (value c13) from 65 to 55
   goals met: 9 of 14
94. (decrement c12)
   changed: (value c12) from 84 to 81
   goals met: 9 of 14
95. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 9 of 14
96. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 9 of 14
97. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 9 of 14
98. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 9 of 14
99. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 9 of 14
100. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 9 of 14
101. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 9 of 14
102. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 9 of 14
103. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 9 of 14
104. (increment c10)
   changed: (value c10) from 25 to 34
   goals met: 8 of 14
105. (increment c10)
   changed: (value c10) from 34 to 43
   goals met: 8 of 14
106. (increment c10)
   changed: (value c10) from 43 to 52
   goals met: 8 of 14
107. (increment c10)
   changed: (value c10) from 52 to 61
   goals met: 8 of 14
108. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 8 of 14
109. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 8 of 14
110. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 8 of 14
111. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 8 of 14
112. (increment c10)
   changed: (value c10) from 61 to 70
   goals met: 8 of 14
113. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 8 of 14
114. (increment c11)
   changed: (value c11) from 26 to 31
   goals met: 8 of 14
115. (increment c11)
   changed: (value c11) from 31 to 36
   goals met: 8 of 14
116. (increment c11)
   changed: (value c11) from 36 to 41
   goals met: 8 of 14
117. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 8 of 14
118. (increment c11)
   changed: (value c11) from 41 to 46
   goals met: 8 of 14
119. (increment c11)
   changed: (value c11) from 46 to 51
   goals met: 8 of 14
120. (increment c11)
   changed: (value c11) from 51 to 56
   goals met: 8 of 14
121. (increment c11)
   changed: (value c11) from 56 to 61
   goals met: 8 of 14
122. (increment c11)
   changed: (value c11) from 61 to 66
   goals met: 8 of 14
123. (increment c11)
   changed: (value c11) from 66 to 71
   goals met: 9 of 14
124. (increment c10)
   changed: (value c10) from 70 to 80
   goals met: 8 of 14
125. (decrement c9)
   changed: (value c9) from 93 to 91
   goals met: 8 of 14
126. (increment c11)
   changed: (value c11) from 71 to 76
   goals met: 8 of 14
127. (increment c10)
   changed: (value c10) from 80 to 90
   goals met: 8 of 14
128. (decrement c9)
   changed: (value c9) from 91 to 89
   goals met: 9 of 14
129. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 9 of 14
130. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 9 of 14
131. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 9 of 14
132. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 9 of 14
133. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 9 of 14
134. (increment c1)
   changed: (value c1) from 11 to 16
   goals met: 8 of 14
135. (increment c1)
   changed: (value c1) from 16 to 21
   goals met: 8 of 14
136. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 8 of 14
137. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 8 of 14
138. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 8 of 14
139. (increment c1)
   changed: (value c1) from 21 to 27
   goals met: 8 of 14
140. (increment c2)
   changed: (value c2) from 12 to 18
   goals met: 8 of 14
141. (increment c2)
   changed: (value c2) from 18 to 24
   goals met: 8 of 14
142. (increment c2)
   changed: (value c2) from 24 to 30
   goals met: 9 of 14
143. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 9 of 14
144. (increment c1)
   changed: (value c1) from 27 to 34
   goals met: 8 of 14
145. (increment c2)
   changed: (value c2) from 30 to 36
   goals met: 8 of 14
146. (increment c1)
   changed: (value c1) from 34 to 41
   goals met: 7 of 14
147. (decrement c2)
   changed: (value c2) from 36 to 30
   goals met: 8 of 14
148. (decrement c0)
   changed: (value c0) from 42 to 40
   goals met: 9 of 14
149. (increment c14)
   changed: (value c14) from 42 to 46
   goals met: 9 of 14
150. (increment c14)
   changed: (value c14) from 46 to 50
   goals met: 9 of 14
151. (increment c14)
   changed: (value c14) from 50 to 54
   goals met: 9 of 14
152. (increment c14)
   changed: (value c14) from 54 to 58
   goals met: 10 of 14
153. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 10 of 14
154. (increment c13)
   changed: (value c13) from 55 to 65
   goals met: 9 of 14
155. (decrement c12)
   changed: (value c12) from 81 to 77
   goals met: 9 of 14
156. (increment c14)
   changed: (value c14) from 58 to 62
   goals met: 9 of 14
157. (increment c14)
   changed: (value c14) from 62 to 66
   goals met: 10 of 14
158. (increment c7)
   changed: (value c7) from 65 to 75
   goals met: 9 of 14
159. (increment c7)
   changed: (value c7) from 75 to 85
   goals met: 10 of 14
160. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 10 of 14
161. (increment c8)
   changed: (value c8) from 69 to 75
   goals met: 10 of 14
162. (increment c8)
   changed: (value c8) from 75 to 81
   goals met: 10 of 14
163. (increment c8)
   changed: (value c8) from 81 to 87
   goals met: 11 of 14
164. (increment c2)
   changed: (value c2) from 30 to 36
   goals met: 10 of 14
165. (increment c2)
   changed: (value c2) from 36 to 42
   goals met: 11 of 14
166. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 11 of 14
167. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 11 of 14
168. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 11 of 14
169. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 11 of 14
170. (increment c13)
   changed: (value c13) from 65 to 75
   goals met: 10 of 14
171. (increment c14)
   changed: (value c14) from 66 to 70
   goals met: 10 of 14
172. (increment c14)
   changed: (value c14) from 70 to 74
   goals met: 10 of 14
173. (increment c14)
   changed: (value c14) from 74 to 78
   goals met: 11 of 14
174. (increment c13)
   changed: (value c13) from 75 to 85
   goals met: 11 of 14
175. (increment c14)
   changed: (value c14) from 78 to 82
   goals met: 11 of 14
176. (increment c14)
   changed: (value c14) from 82 to 86
   goals met: 12 of 14
177. (decrement c2)
   changed: (value c2) from 42 to 32
   goals met: 12 of 14
178. (decrement c1)
   changed: (value c1) from 41 to 34
   goals met: 11 of 14
179. (decrement c1)
   changed: (value c1) from 34 to 27
   goals met: 12 of 14
180. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 12 of 14
181. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 12 of 14
182. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 12 of 14
183. (decrement c0)
   changed: (value c0) from 40 to 35
   goals met: 12 of 14
184. (decrement c0)
   changed: (value c0) from 35 to 30
   goals met: 12 of 14
185. (decrement c0)
   changed: (value c0) from 30 to 25
   goals met: 13 of 14
186. (increment c11)
   changed: (value c11) from 76 to 81
   goals met: 12 of 14
187. (increment c12)
   changed: (value c12) from 77 to 81
   goals met: 12 of 14
188. (increment c12)
   changed: (value c12) from 81 to 85
   goals met: 12 of 14
189. (increment c13)
   changed: (value c13) from 85 to 95
   goals met: 12 of 14
190. (increment c14)
   changed: (value c14) from 86 to 90
   goals met: 12 of 14
191. (increment c14)
   changed: (value c14) from 90 to 94
   goals met: 12 of 14
192. (increment c14)
   changed: (value c14) from 94 to 98
   goals met: 13 of 14
193. (increment c11)
   changed: (value c11) from 81 to 86
   goals met: 12 of 14
194. (increment c12)
   changed: (value c12) from 85 to 89
   goals met: 13 of 14
195. (increment c11)
   changed: (value c11) from 86 to 91
   goals met: 13 of 14
196. (increment c12)
   changed: (value c12) from 89 to 93
   goals met: 14 of 14
